spec/vcr_cassettes/PayPalPurchasesCart/successful_credit_card_purchase/updates_the_ticket_status.yml

---
http_interactions:
- request:
    method: post
    uri: https://EBWKjlELKMYqRNQ6sYvFo64FtaRLRR5BdHEESmha49TM:EO422dn3gQLgDbuwqTjzrFgFtaRLRR5BdHEESmha49TM@api.sandbox.paypal.com/v1/oauth2/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials
    headers:
      User-Agent:
      - PayPalSDK/PayPal-Ruby-SDK 1.4.1 (paypal-sdk-core 1.4.1; ruby 2.3.0p0-x86_64-darwin15;OpenSSL
        1.0.2e 3 Dec 2015)
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Sun, 06 Mar 2016 21:56:28 GMT
      Server:
      - Apache
      Proxy-Server-Info:
      - host=slcsbplatformapiserv3001.slc.paypal.com;threadId=460
      Paypal-Debug-Id:
      - dc27fb6bde42
      - dc27fb6bde42
      Correlation-Id:
      - dc27fb6bde42
      X-Paypal-Token-Service:
      - IAAS
      Set-Cookie:
      - X-PP-SILOVER=; Expires=Thu, 01 Jan 1970 00:00:01 GMT
      - X-PP-SILOVER=name%3DSANDBOX3.API.1%26silo_version%3D1880%26app%3Dplatformapiserv%26TIME%3D2359811158;
        domain=.paypal.com; path=/; Secure; HttpOnly
      Vary:
      - Authorization
      Content-Length:
      - '449'
      Connection:
      - close
      Content-Type:
      - application/json
    body:
      encoding: UTF-8
      string: '{"scope":"https://api.paypal.com/v1/payments/.* https://api.paypal.com/v1/vault/credit-card
        openid https://api.paypal.com/v1/developer/.* https://api.paypal.com/v1/vault/credit-card/.*","nonce":"2016-03-06T21:56:28ZoM_OU62vIKQ2d1_3xU0uenw7WsjILTcARaSC5tjxZYQ","access_token":"A101.C53T72yuhenhSbRIi-GgLEY3HBgH417lfVhD9si8BH6JIauYx8N0_iMePwM7yE1R.YV7KBsZc9oDNDJRjkrFJsoqaGG4","token_type":"Bearer","app_id":"APP-2EJ531395M785864S","expires_in":32400}'
    http_version: 
  recorded_at: Sun, 06 Mar 2016 21:56:29 GMT
- request:
    method: post
    uri: https://api.sandbox.paypal.com/v1/payments/payment
    body:
      encoding: UTF-8
      string: '{"intent":"sale","payer":{"payment_method":"paypal"},"transactions":[{"amount":{"currency":"USD","total":"30.00"},"item_list":{"items":[{"quantity":"1","price":"15.00","currency":"USD"},{"quantity":"1","price":"15.00","currency":"USD"}]}}],"redirect_urls":{"return_url":"http://localhost:3000/paypal/approved","cancel_url":"http://localhost:3000/paypal/rejected"}}'
    headers:
      X-Paypal-Sandbox-Email-Address:
      - Platform.sdk.seller@gmail.com
      Authorization:
      - Bearer A101.C53T72yuhenhSbRIi-GgLEY3HBgH417lfVhD9si8BH6JIauYx8N0_iMePwM7yE1R.YV7KBsZc9oDNDJRjkrFJsoqaGG4
      Content-Type:
      - application/json
      User-Agent:
      - PayPalSDK/PayPal-Ruby-SDK 1.4.1 (paypal-sdk-core 1.4.1; ruby 2.3.0p0-x86_64-darwin15;OpenSSL
        1.0.2e 3 Dec 2015)
      Paypal-Request-Id:
      - ba0620d7-92d0-4f04-b32d-816cbcf1d5c1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Sun, 06 Mar 2016 21:56:29 GMT
      Server:
      - Apache
      Proxy-Server-Info:
      - host=slcsbplatformapiserv3002.slc.paypal.com;threadId=273
      Paypal-Debug-Id:
      - 8169bb956bc24
      - 8169bb956bc24
      Correlation-Id:
      - 8169bb956bc24
      Content-Language:
      - "*"
      Set-Cookie:
      - X-PP-SILOVER=; Expires=Thu, 01 Jan 1970 00:00:01 GMT
      - X-PP-SILOVER=name%3DSANDBOX3.API.1%26silo_version%3D1880%26app%3Dplatformapiserv%26TIME%3D2376588374;
        domain=.paypal.com; path=/; Secure; HttpOnly
      Vary:
      - Authorization
      Content-Length:
      - '757'
      Connection:
      - close
      Content-Type:
      - application/json
    body:
      encoding: UTF-8
      string: '{"id":"PAY-6D6883781R595843DK3OKPDI","intent":"sale","state":"created","payer":{"payment_method":"paypal"},"transactions":[{"amount":{"total":"30.00","currency":"USD"},"item_list":{"items":[{"price":"15.00","currency":"USD","quantity":1},{"price":"15.00","currency":"USD","quantity":1}]},"related_resources":[]}],"create_time":"2016-03-06T21:56:29Z","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-6D6883781R595843DK3OKPDI","rel":"self","method":"GET"},{"href":"https://www.sandbox.paypal.com/cgi-bin/webscr?cmd=_express-checkout&token=EC-6YV98703E6718940G","rel":"approval_url","method":"REDIRECT"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-6D6883781R595843DK3OKPDI/execute","rel":"execute","method":"POST"}]}'
    http_version: 
  recorded_at: Sun, 06 Mar 2016 21:56:29 GMT
recorded_with: VCR 3.0.1
